USE test;

DROP TABLE IF EXISTS parts;
CREATE TABLE parts(
                      id INT(11) NOT NULL AUTO_INCREMENT,
                      count INT(11),
                      required BIT(1),
                      name VARCHAR(255),
                      PRIMARY KEY (id)
)
    ENGINE = InnoDB
    DEFAULT CHARACTER SET = utf8;

INSERT INTO parts (id, count, required, name) VALUES
(1, 3, 1, 'Материнская плата'),
(2, 2, 0, 'Звуковая карта'),
(3, 2, 1, 'Процессор'),
(4, 0, 0, 'Подсветка корпуса'),
(5, 1, 0, 'HDD диск'),
(6, 10, 1, 'Корпус'),
(7, 10, 1, 'Память'),
(8, 15, 1, 'SDD диск'),
(9, 3, 1, 'Блок питания'),
(10, 12, 1, 'Кулер для процессора'),
(11, 7, 0, 'CD привод'),
(12, 8, 0, 'DVD привод'),
(13, 0, 0, 'Монитор 15 дюймов'),
(14, 2, 0, 'Монитор 17 дюймов'),
(15, 5, 0, 'Монитор 19 дюймов'),
(16, 3, 0, 'Монитор 21 дюймов'),
(17, 11, 0, 'Принтер'),
(18, 12, 0, 'Сканер'),
(19, 13, 0, 'МФУ'),
(20, 15, 1, 'Кулер для корпуса'),
(21, 5, 0, 'Клавиатура'),
(22, 5, 0, 'Мышь'),
(23, 10, 0, 'Звуковые колонки'),
(24, 1, 0, 'Картридер'),
(25, 100, 1, 'Кабеля SATA');